It is not possible to apply the host family's grid specification to this instance.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotApplyGridSpecification { get; }
  Visual Basic
Public Shared ReadOnly Property CannotApplyGridSpecification As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotApplyGridSpecification {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures CurtainWallFailures Class
  Autodesk.Revit.DB Namespace